/*
 *  2차(이중) for문
 *  
 *    for() ==> 줄수(rows)
 *    {
 *    	for() ==> 화면 출력(cols)
 *    	{
 *    	  실행문장
 *    	}
 *    }
 *    
 *    *
 *    **
 *    ***
 *    ****
 *    ------------
 *     i   j
 *    줄수 별표
 *    1    1
 *    2    2
 *    3    3
 *    4    4
 *    
 *    ****
 *    ***
 *    **
 *    *
 *   -------
 *   1	4
 *   2	3
 *   3	2
 *   4	1 역순이면 더한다 => i+j=5 => j=5-i
 *    
 *       *
 *      **
 *     ***
 *    ****
 *   ----------
 *    i  j   k
 *   줄수 공백 별표
 *   1	 3	 1
 *   2	 2	 2
 *   3	 1	 3
 *   4 	 0	 4
 *   => i+j=4 => j=4-i
 *   => k=i
 *    
 *    ****
 *     ***
 *      **
 *       *
 *  ----------
 *   i  j   k
 *  줄수 공백 별표
 *   1	 0	 4
 *   2	 1	 3
 *   3	 2	 2
 *   4 	 3	 1
 *   => i+k=5 => k=5-i
 *   => j=i-1
 *        
 *  ---문제---
 *  
 *     *
 *    ***
 *   *****
 *  *******
 *   *****
 *    ***
 *     *
 *  -----------
 *   i  j   k
 *  줄수 공백 별표
 *   1	 6   1
 *   2	 4   3
 *   3	 2   5
 *   4 	 0   7
 *   => 
 *  -----------
 *   5   2   5
 *   6   4   3
 *   7   6   1
 *   => 
 *     
 *   *****
 *    ***
 *     *
 *    ***
 *   *****
 *   
 *   *   *
 *   ** **
 *   *****
 *   ** **
 *   *   *
 */ 
public class 제어문_4 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub
		for(int i=1;i<=4;i++)
		{
			for(int j=1;j<=i-1;j++)
			{
				System.out.print(" ");
			}
			for(int k=1;k<=5-i;k++)
			{
				System.out.print("*");
			}
			System.out.println();
		}
	}

}
