/*
 * 4페이지 : 실행과정
 * 5페이지 : 자바의 장점
 * 14페이지 : 바이트 코드(.java => javac => .class)
 * 										------ 바이트코드
 * 								동일한 코드 => 운영체제 호환 => 배포
 * 28페이지 : main() 설명
 * 29페이지 : 주석 처리 방법
 * 30페이지 : ;(세미콜론)에 대한 설명
 * 
 * 36페이지 : 변수의 개념
 * 41페이지 : 정수에 대한 설명과 크기
 * 43페이지 : 정수 표현법 => 10진법, 2진법일 때
 * 
 * 45페이지 : 문자 => '한개문자'
 * 47페이지 : 실수에 대한 설명
 * 50페이지 : boolean
 * 51페이지 : 문자열(String)
 * 52페이지 : 특수문자 
 * 
 * 55페이지 : 자동 형변환
 * 57페이지 : 강제 형변환
 * 66페이지 : String을 각 데이터형으로 변경
 * 72페이지 : Scanner 설명
 * 
 * -----------------------------------------
 * 81페이지 : 증감연산자
 * 83페이지 : 산술연산자
 * 90페이지 : 비교연산자
 * 93페이지 : 논리연산자
 * 104페이지 : 대입연산자
 * 105페이지 : 삼항연산자
 */

public class 정리_5 {

	public static void main(String[] args) {
		// TODO Auto-generated method stub

	}

}
